# -*- encoding: utf-8 -*-
AllInfoConfig = [
    {
        "module": "gameIntroduction",
        "moduleName": "游戏介绍",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "【主线】大救星你可终于来了",
                "emailMan": "发信人：点火员维勒之博士",
                "richText": [
                    "<leftTxt>嗯嗯嗯嗯嗯嗯嗯：\n嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯"
                    "嗯嗯嗯：\n嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯"
                    "嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯。",
                    "<rightTxt>\n 嗯嗯，\n嗯嗯嗯嗯嗯",
                    "<leftTxt>\n \n（幸存者，您好：\n    我是目前世界联合机构首席科学家维勒之博士。感谢您能为地球做出贡献。我将简单的为您介绍一下当"
                    "前的情况：\n    随着太阳内部的氢耗尽后，不再散发热量，地球也变得越来越冷。我们通过建造星球发动机，推动地球脱离太阳系，"
                    "前往宇宙深处以寻找新的家园。但是随着地球轨道的改写，自然灾害和特殊天气频发，摧毁了很多星球发动机，您的任务就是将被"
                    "摧毁的星球发动机重新点燃。",
                    "<rightTxt>祝好，\n维勒之博士）",
                    "<leftTxt>由酸黄瓜科技为您翻译。\n ",
                    "<image>game_intro1"
                ]
            },
            {
                "title": "【背景】好诗，好湿！",
                "emailMan": "发信人：老黄瓜",
                "richText": [
                    "<middleTxt>《星球生存·未来》\n[现代]老黄瓜\n ",
                    "<middleTxt>星球生存滔天浪，地球家园欲启航。\n太阳衰老光渐暗，人类危机刻不让。\n星际迁徙何其难，"
                    "千载历程梦中藏。\n地球推进巨轮转，世界同心共张扬。\n ",
                    "<middleTxt>冰封大地寒风啸，遗迹城市人烟稀。\n巨柱擎天推星河，星球转动天地移。\n灾难频发祸起端，"
                    "冰雪怒卷雷霆急。\n亲情友情万般难，生死抉择心头泣。\n ",
                    "<middleTxt>天降陨石携病毒，感染丧尸更艰难。\n"
                    "推离星轨违天理，前路祸福尤未知。\n"
                    "自然灾害频来临，陨石欲毁家园变。\n"
                    "群英奋起勇担当，同心协力共度难。\n ",
                    "<middleTxt>火星吸引重如山，小金舍生灭顶灾。\n"
                    "全球合力推地返，舍身取义众志开。\n"
                    "无数英雄献身先，救赎之路血泪斑。\n"
                    "风雪过后曙光现，地球航程望无边。\n ",
                    "<middleTxt>千年计划终始成，太空漂泊路漫长。\n"
                    "人类家园再出发，生生不息梦尤长。\n"
                    "星球生存心未变，愿将希望寄远航。\n"
                    "星辰大海行无尽，宇宙深处再续章。\n ",
                    "<image>game_intro2"
                ]
            },
            {
                "title": "【事件】异常天气汇报",
                "emailMan": "发信人：机构雇员战京",
                "richText": [
                    "<middleTxt>关于异常天气汇报\n【RES-781-02号】",
                    "<rightTxt>汇报人：战京",
                    "<leftTxt>地点：022号星球发动机以西2330格；以西3298格；\n当事人：战京、刘齐齐\n描述：机构救援队雇员战京参"
                    "加[RES-781-02]任务时，发生两次异常天气：",
                    "<leftTxt>[代号：赤潮]\n事件表现为：天空突然变得血红，异常生物（或许叫丧尸更合适）数量变得更多，"
                    "伤害和血量更高、移速更快。防御据点几尽失守，真是恐怖的一个晚上。\n ",
                    "<image>game_intro3",
                    "<leftTxt> \n[现象：陨石]\n事件表现为：突然间开始地动山摇，无数的陨石砸了下来，仿佛地震了一般。我们一直向前跑了"
                    "七八千格才停了下来。等过了一天返回现场时，发现一种特殊的陨石矿物，整体呈暗红色，"
                    "其中有金色的颗粒金属，坚硬无比。已将样本带回。\n ",
                    "<image>game_intro4",
                    "<leftTxt> \n[遭遇：末日商人]\n返程途中遭遇末日商人，他牵着两匹外观为白色的金属骆驼，疑似能够给他提供庇护（虽是末日但仍难逃奸商的本质）。\n ",
                    "<image>game_intro5",
                    "<middleTxt> \n—————————————————END————————————————"
                ]
            },
            {
                "title": "【生物】关于异常生物的推测",
                "emailMan": "发信人：科学家威乐志博士",
                "richText": [
                    "<leftTxt>    嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯"
                    "嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯。",
                    "<rightTxt> \n嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯\n \n ",
                    "<leftTxt>    （早上好，晚上坏！因为据相关研究发现。表明晚上僵尸会变得更强！这类出现异常的生物都有一些共性：深色的皮"
                    "肤，呈现棕色或蓝色（疑似应对寒冷环境后的变异），并且伤口处呈现绿色或蓝色的脓疮。棕色的僵尸智商较低，但成群结队，也很难"
                    "对付；皮肤蓝色的僵尸往往有更高的智慧。随着时间的推移，它们似乎也变得越来越强，请一定小心面对。）",
                    "<rightTxt>对未来担忧的威乐知博士",
                    "<leftTxt>由酸黄瓜科技为您翻译。\n \n附件1：\n ",
                    "<image>game_intro6"
                ]
            }
        ]
    },
    {
        "module": "taskSystem",
        "moduleName": "任务系统",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "【支线-讨伐】关乎人类的未来",
                "emailMan": "发信人：科学家韦磊知博士",
                "richText": [
                    "<leftTxt>    嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯。\n"
                    "    嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯。",
                    "<rightTxt>嗯嗯，\n嗯嗯嗯嗯嗯",
                    "<leftTxt>（幸存者，您好：\n    我是驻世界联合机构韦磊知博士。如果您能帮忙讨伐那些异常生物，并收集它们的样本给我，"
                    "那将会再好不过了，我的奖励都放在了支线任务当中。\n    每当你攻击一种异常生物时，它们就会被记录在你随身携带的智能设"
                    "备当中，这也是很宝贵的研究资料！\nps：它们的适应能力很强，我丝毫不怀疑哪怕到了新的适合人类居住的环境，它们适应和进"
                    "化的速度会比人类快得多。这些异常生物的威胁可能和吸过来的火星相比有过之而无不及。",
                    "<rightTxt>此致\n韦磊知博士）",
                    "<leftTxt>由酸黄瓜科技为您翻译。\n \n附件1：\n ",
                    "<image>task_intro1"
                ]
            },
            {
                "title": "【支线-生存】关于幸存者补给通知",
                "emailMan": "发信人：世界联合机构(UWG)",
                "richText": [
                    "<middleTxt>世界联合机构文件\n【NOT-220-05号】\n———————————————————————————————————\n关于幸存者补给通知\n ",
                    "<leftTxt>    为切实保障当今幸存者的基本生活需求，确保社会稳定和人心安定，根据现有资源和实际情况，给予幸存者进行生"
                    "存时必要的奖励。将通过酸黄瓜牌智能设备进行发放，请各单位认真贯彻执行以及及时领取。\n特此通知。\n世界联合机构-物资管理局"
                    "\n附件1：\n ",
                    "<image>task_intro2",
                    "<middleTxt> \n—————————————————END————————————————"
                ]
            }
        ]
    },
    {
        "module": "itemSystem",
        "moduleName": "物品系统",
        "content": [
            {
                "title": "【工事】末日生存指南",
                "emailMan": "发信人：世界联合机构（UWG）",
                "richText": [
                    "<leftTxt>末日生存指南\n \n【前言】\n在末日环境下生存，充满了未知与挑战。本指南旨在为幸存者提供实"
                    "用的生存建议，帮助大家在极端环境中保持生存能力和希望。\n ",
                    "<leftTxt>【基本生存原则】\n① 适应环境：随着地球开启宇宙行程，环境和天气多变且充满危险。快速适应新环境，"
                    "及时了解周围的资源和威胁。\n② 保持冷静：面对危机时保持冷静，理智做出决策。就像老黄瓜说过的那样，"
                    "遇事不慌，保持冷静，才能更好地应对挑战。\n③ 合作共赢：与其他幸存者合作，共同应对困境。请先确保他/她"
                    "还有足够多的理智，而不是丧尸，否则幸存者交流时永远会以你为笑柄。\n④ 远离丧尸：四处游荡的可不止是无所事事的"
                    "小混混，小心分辨游荡的异常生物，它们往往展现较强的攻击性。\n ",
                    "<image>item_intro1",
                    "<leftTxt> \n【食物与水的获取和储存】\n① 食物获取：优先寻找高热量、易储存的食物，如糖果、干粮、零食等。\n② 水源确认："
                    "寻找清洁水源（反正除了饮料和开水也没有别的能喝），必要时可优先引用包装完好的饮料及开水。打水时看看上游，"
                    "说不定就有喜欢泡澡的丧尸。\n③ 储存方法：保持食物和水的干燥、阴凉，避免污染和变质，腹泻在末日时期可是十分致命的问题。",
                    "<imageSmall>item_intro2",
                    "<leftTxt> \n【健康与医疗】\n① 常备药品：储备常用药品，如抗生素、抗辐射液、止痛药和绷带。\n② 定期检查：定期检查身体"
                    "状况，发现异常及时处理，头痛砍头，脚痛砍脚。\n③ 卫生习惯：保持个人卫生，防止感染和疾病传播。\n④ 寻找热源："
                    "有能够发出热源的物品能够快速的提高体温，如岩浆、篝火、取暖器等。",
                    "<imageSmall>item_intro3",
                    "<leftTxt> \n【武器与装备】\n① 相关载具：车辆永远是最忠实的伙伴，但请确保它的能源值和耐久度处于较好"
                    "的状态。\n② 科技武器：注意近战武器及远程枪械的耐久度，被僵尸团团围住时卡壳可是一个致命的玩笑。\n③ 其他装备：一套"
                    "好的盔甲是在末日生存中不可缺少的物品。想在寒冷的天气中生存，一套吉利服是最低的选择。",
                    "<imageSmall>item_intro4",
                    "<leftTxt> \n【避难所的选择与建设】\n① 位置选择：选择地势较高、视野较好、远离危险区域的地点，当发现危险时能及"
                    "时跑路，你给路达哟~\n② 基本设施：确保长驻避难所具备防风、防寒的功能，且需要有足够的热源。不然路过的幸存者都会脱"
                    "帽向冻成一坨人形的冰块默哀。\n③ 材料准备：使用坚固材料（如金属块、木板）构建避难所，保证结构稳定，这次“"
                    "吹”毁你的稻草屋的可不是大灰狼，而是成群结队的丧尸。",
                    "<imageSmall>item_intro5",
                    "<leftTxt> \n【安全与防护】\n① 防护工具：装备基本防护工具，如头盔、胸甲、护腿和靴子。穿上一身装备肯定比裸奔"
                    "要强，等丧尸恶心的粘液沾到身上时再后悔就晚了。\n② 安全巡查：定期检查避难所周围环境，确保无"
                    "潜在威胁。小心一点！未雨绸缪永远都不会有错。\n③ 防护措施：设置必要的防御工事，并安排值班人"
                    "员守夜，您肯定也不想丧尸爬进被窝时才发现它。",
                    "<imageSmall>item_intro6",
                    "<leftTxt> \n【社交与心理支持】\n① 保持沟通：通过消息系统或其他通信设备与外界保持联系。\n② 心理支持：互相安"
                    "慰、鼓励，保持积极心态，避免孤立和绝望感，实在社恐的话给自己唱首歌也行。\n③ 团队活动"
                    "：组织集体活动，如讨论会、游戏，增强团队凝聚力。",
                    "<imageSmall>item_intro7",
                    "<leftTxt> \n【自救与互救】\n① 基本技能：学习急救技能，如包扎伤口、服用药物等，技多不压身。\n② 互助"
                    "精神：在危急时刻，互相帮助，共同应对危机。\n③ 逃生计划：制定详细的逃生计划或预案，确保在突发事"
                    "件中能够迅速撤离。狡兔三窟，多留点心眼总是没错的。\n④ 车辆救援：如出现车辆被困得情况，请使用救援信号发射器进行脱困。",
                    "<imageSmall>item_intro8",
                    "<leftTxt> \n【重要物品清单】\n① 食物和水：高热量食物、饮用水、包装完好的饮料。\n② 药品和医疗用"
                    "品：常用药品、急救包、抗生素。\n③ 武器和设备：棒球棍、枪械、发电机、取暖设备。\n④ 衣物和防"
                    "护：保暖衣物、救援服、盔甲。\n⑤ 通信设备：救援信号发射器、雷达。",
                    "<imageSmall>item_intro9",
                ]
            },
            {
                "title": "【电力】最新科技！电力知识早知道！",
                "emailMan": "发信人：无良小编",
                "richText": [
                    "<leftTxt>    众所周知，用电设备是最近在幸存者里非常火的一个词。那么用电设备到底有哪些呢？今天小编就带大家来看看"
                    "究竟是怎么一回事。\n \n    据小编所知，电器分为供电器和用电器两种，供电器主要为发电机，以及由伟"
                    "大的酸黄瓜科技培育的电骆驼等等；用电器则为3D打印机、光刻机等等。\n \n    不同的供电器发电范围和供电瓦数不一样，所以在"
                    "使用的时候，一定要注意用电安全噢~\n \n    以上就是小编为大家带来的的关于用电设备是什么的内容。关于"
                    "用电设备大家还有什么想说的吗？欢迎在评论区留言哦~\n ",
                    "<image>item_intro10",
                ]
            },
            {
                "title": "【材料】太神奇了！材料知识早知道！",
                "emailMan": "发信人：无良小编",
                "richText": [
                    "<leftTxt>    大家都知道，现末日社会中随着人们生存水平的提高，高科技材料如今也成为了"
                    "人们茶余饭后的谈资。相信大家对高科技材料都很熟悉，但是高科技材料是怎么回事呢？\n \n    高科技材料其实就是高科技"
                    "材料，目前在幸存者圈子里拥有非常高的热度。【新发现的矿物主要有四种，铅、锂、稀土和陨石，并且大"
                    "家可以用它们制作出对应的工具，也是制造靠科技工具和装备必不可少的物品】大家可能会感到很惊讶，高科"
                    "技材料为什么是这样的？但事实就是这样，小编也感到非常惊讶。\n \n    那么以上就是今天小编为大家整理的关于高科技材"
                    "料为什么火的原因。希望这篇文章能对你有所帮助，大家有什么想法，可以在下方评论区给小编留言。\n ",
                    "<image>item_intro11",
                ]
            },
            {
                "title": "【装备】超级震惊！装备制造早知道！",
                "emailMan": "发信人：无良小编",
                "richText": [
                    "<leftTxt>    关于物品如何制造是怎么回事呢？相信大家都很熟悉，但是物品如何制造又是怎么回事呢，下面"
                    "就让小编带大家一起了解吧。\n \n    物品如何制造，【其实就是用工作台就可以查看到配方，显而易见的是3D打"
                    "印机是由铜锭、金锭、锂锭、螺丝钉、铁丝、塑料板合成的，只要合成出3D打印机，再配一个发电设备，其他"
                    "高科技物品就都可以制造啦！】。大家可能会很惊讶物品怎么会是这样制造呢？但事实就是这样，小编也感到非常惊讶。\n \n    这就是"
                    "关于物品如何制造的事情了，大家有什么想法呢，欢迎在评论区告诉小编一起讨论哦！\n ",
                    "<image>item_intro12",
                ]
            }
        ]
    },
    {
        "module": "story",
        "moduleName": "故事",
        "content": [
            {
                "title": "【广告】酸黄瓜翻译器，你值得拥有",
                "emailMan": "发信人：酸黄瓜科技",
                "richText": [
                    "<leftTxt>嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯嗯——什么，你听不懂村民说话？快来用酸黄瓜最新科技——酸黄瓜翻译器！只要拥有此款神器，妈妈再也不用担心我的对话啦！"
                ]
            }
        ]
    }
]


GameIntroConfig = [
    {
        "module": "baseInform",
        "moduleName": "基础信息",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "组件联动介绍",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/14"
                ]
            },
            {
                "title": "罐头内容梗概",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/01"
                ]
            },
            {
                "title": "流程指引",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/02"
                ]
            },
        ]
    },
    {
        "module": "wikiPedia",
        "moduleName": "百科知识",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "异常气候种类",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/03"
                ]
            },
            {
                "title": "异常生物简介",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/04"
                ]
            },
        ]
    },
    {
        "module": "commonGuide",
        "moduleName": "常用指南",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "如何寻找星球发动机",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/05"
                ]
            },
            {
                "title": "如何使用酸黄瓜牌智能设备（菜单）",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/06"
                ]
            },
            {
                "title": "如何制造枪械及盔甲",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/07"
                ]
            },
            {
                "title": "如何操作与修复车辆",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/08"
                ]
            },
            {
                "title": "如何建造设施",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/09"
                ]
            },
            {
                "title": "如何使用发电机及用电器",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/10"
                ]
            },
        ]
    },
    {
        "module": "surviveRule",
        "moduleName": "生存守则",  # 图片显示路径：res/textures/ui/scuke_survive/help/
        "content": [
            {
                "title": "寒冷天气应对方法",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/11"
                ]
            },
            {
                "title": "长期避难所选址与建设",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/12"
                ]
            },
            {
                "title": "安全与防护",
                "emailMan": "",
                "richText": [
                    "<imageSquare>game_introduce/13"
                ]
            },
        ]
    },
    # {
    #     "module": "connect",
    #     "moduleName": "组件联动",  # 图片显示路径：res/textures/ui/scuke_survive/help/
    #     "content": [
    #         {
    #             "title": "组件联动介绍",
    #             "emailMan": "",
    #             "richText": [
    #                 "<imageSquare>14"
    #             ]
    #         }
    #     ]
    # },
]